## kosullu eleman islemleri

In [1]:
import numpy as np
import pandas as pd

m = np.random.randint(1, 30, size=(10, 3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    14    27    22
1     6    14    15
2    13    16     1
3    28    18    22
4    21     8    15
5    13    22     9
6     7     1    18
7     7    26    26
8    23    10    23
9    13    29     4

In [2]:
df["var1"]

0    14
1     6
2    13
3    28
4    21
5    13
6     7
7     7
8    23
9    13
Name: var1, dtype: int32

In [3]:
df["var1"][0:2]

0    14
1     6
Name: var1, dtype: int32

In [4]:
df[0:2]

   var1  var2  var3
0    14    27    22
1     6    14    15

In [5]:
df[0:2][["var1", "var2"]]

# fancy index ile erişilebilir

   var1  var2
0    14    27
1     6    14

In [6]:
df

# 1. değişkendeki değerlerin 15'ten büyük olup olmadığını gözlemleme

   var1  var2  var3
0    14    27    22
1     6    14    15
2    13    16     1
3    28    18    22
4    21     8    15
5    13    22     9
6     7     1    18
7     7    26    26
8    23    10    23
9    13    29     4

In [7]:
df.var1

0    14
1     6
2    13
3    28
4    21
5    13
6     7
7     7
8    23
9    13
Name: var1, dtype: int32

In [8]:
df[df.var1 > 15]

# var1 isimli değişkende sadece 15'ten büyük olanları getirdi

   var1  var2  var3
3    28    18    22
4    21     8    15
8    23    10    23

In [9]:
df[df.var1 > 15]["var2"]

# yukarıda getirilmiş olan bilgiden sadece "var2" sütununu filtreler

3    18
4     8
8    10
Name: var2, dtype: int32

In [10]:
df[(df.var1 > 15) & (df.var3 < 10)]

# bu şekildeki kullanımda, aynı anda var1 sütununda 15'ten büyük ve var3 sütununda 10dan küçük olan değerleri filtreler

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [11]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

# loc seçim

   var1  var2
3    28    18
4    21     8
8    23    10

In [12]:
df[(df.var1 > 15)][["var1", "var2"]]

# iloc seçim

   var1  var2
3    28    18
4    21     8
8    23    10